run/CleanCases/STL_Limonene_Breathing_base/0/Qdot
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Qdot;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet1
    {
        type            calculated;
        value           uniform 0;
    }
    inlet2
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    windowsmall
    {
        type            calculated;
        value           uniform 0;
    }
    door
    {
        type            calculated;
        value           uniform 0;
    }
    columns
    {
        type            calculated;
        value           uniform 0;
    }
    windowbig
    {
        type            calculated;
        value           uniform 0;
    }
    ceiling
    {
        type            calculated;
        value           uniform 0;
    }
    floor
    {
        type            calculated;
        value           uniform 0;
    }
    wallwindow
    {
        type            calculated;
        value           uniform 0;
    }
    walldoor
    {
        type            calculated;
        value           uniform 0;
    }
    walloutside
    {
        type            calculated;
        value           uniform 0;
    }
    wallinside
    {
        type            calculated;
        value           uniform 0;
    }
    emission_surface
    {
        type            calculated;
        value           uniform 0;
    }
    IOLet_L_Man
    {
        type            calculated;
        value           uniform 0;
    }
    IOLet_R_Man
    {
        type            calculated;
        value           uniform 0;
    }
    LetLessMan
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
