run/CleanCases/STL_Limonene_Breathing_base/system/IntegrateOnSurface
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      IntegrateOnSurface;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
functions
{
    flux_L
    {
        functionObjectLibs ("libfieldFunctionObjects.so");
        type             surfaceFieldValue;

        enabled          true;
        writeControl     outputTime;
        writeInterval    1;
        writeFields      false;

        name IOLet_L_Man;

        // regionType: patch/faceZone/sampledSurface
        regionType patch;//sampledSurface;

        // sampledSurfaceDict
        // {
        //     type                  plane;
        //     planeType             pointAndNormal;
        //     pointAndNormalDict
        //     {
        //         point  (0.1 0 0);
        //         normal (1 0 0);
        //     };
        //     interpolate false;
        // }

        // Operation: areaAverage/sum/weightedAverage/...
        operation    areaNormalIntegrate;
        fields
        (
            U
            CO2
            C10H16
            H2O
            Cprod
            N2
            O2
            O3
        );
    }
}
