run/CleanCases/STL_Limonene_Breathing_base/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoReactingBuoyantFoam;

startFrom       latestTime;//startTime

startTime       0;

stopAt          endTime;

endTime         901;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   0.1;//0.1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxDeltaT       3;
maxCo           2.0;
maxAlphaCo      1;

functions
{
    #includeFunc Qdot
    #includeFunc CourantNo
    volFieldValue1
{
    type            volFieldValue;
    libs            ("libfieldFunctionObjects.so");

    log             true;
    writeControl    writeTime;
    writeFields     true;

    regionType      all;
    operation       volAverage;

    fields
    (
        Cprod
        C10H16
        O3
        O2
        CO2
    );
}
}


// ************************************************************************* //
