run/CleanCases/STL_Limonene_Breathing_base/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "rho.*"
    {
        solver          diagonal;
    }

    p
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-6;
        relTol           0.1;
    }

    "(pFinal|p_rghFinal)"
    {
        $p;
        relTol           0;
    }

    "(U|h|k|epsilon)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.1;
    }

    "(U|h|k|epsilon|e|omega)Final"
    {
        $U;
        relTol          0.1;
    }

    "Yi.*"
    {
        $U;
        relTol          0.1;
    }
}

PIMPLE
{
    momentumPredictor no;
    nOuterCorrectors  2;
    nCorrectors     1;
    nNonOrthogonalCorrectors 0;
    inlet
        {
            type            temperatureLimitsConstraint;
            selectionMode   all;
            active          true;

                temperatureLimitsConstraintCoeffs
                {
                    Tmin     283;
                    Tmax     315;
                }
        }
    maxDeltaT       1e-2;
    maxCo           1.0;
    alphaTemp       0.05;
    rDeltaTSmoothingCoeff 1.0;
    rDeltaTDampingCoeff 1.0;
}

relaxationFactors
{
    equations
    {
        ".*" 1;
    }
}



// ************************************************************************* //
